package s26;

import acm.program.GraphicsProgram;

/**
 * თქვენი ამოცანაა გრაფიკული პროგრამის საშუალებით გააკეთოთ ჩატი.
 * 
 * ფანჯარაზე, SOUTH რეგიონზე უნდა გქონდეთ ერთი ტექსტფილდი და ერთი ღილაკი ტექტით
 * Enter. ტექსტფილდში ტექსტის შეყვანის მერე Enter ჭილაკზე დაჭერით ტექსტი უნდა
 * იწერებოდეს(იხატებოდეს) კანვასზე, ხოლო ტექსტფილდში კი ტექსტი იშლებოდეს.
 * ხელახლა ტექსტის შეყვანისას ახალი ტექსტი წინა ტექსტის ქვემოთ უნდა გამოჩნდეს
 * (როგორც ჩატში ხდება ხოლმე). თუკი ტექსტი ჩაცდება ეკრანს არაუშავს.
 */
public class Ex70 extends GraphicsProgram {

}